In [1]:
import pandas as pd

China CPI

In [2]:
ch = pd.read_excel('cpiChina.xls', skiprows = [1,2,3,4,5,6,7,8,9,10])
ch.rename(columns = {'FRED Graph Observations':'Date', 'Unnamed: 1':'CPI_CH'}, inplace = True)

US CPI

In [3]:
us = pd.read_excel('cpiUS.xls', skiprows = [1,2,3,4,5,6,7,8,9,10])
us.rename(columns = {'FRED Graph Observations':'Date', 'Unnamed: 1':'CPI_US'}, inplace = True)

Indonesian CPI

In [4]:
indo =  pd.read_excel('inflasiIndonesia.xlsx', skiprows = [1,2,3,4], usecols='B,C')
indo['Unnamed: 2'] = indo['Unnamed: 2'].str.rstrip('%').astype('float') / 100.0
indo[['Month','Year']] = indo['Unnamed: 1'].loc[indo['Unnamed: 1'].str.split().str.len() == 2].str.split(expand=True)
indo = indo.iloc[::-1]
indo.replace(['Januari','Februari','Maret',
              'April','Mei','Juni',
              'Juli','Agustus','Oktober',
              'Desember'],['January','February',
                           'March','April','May','June','July',
                           'August','October','December'],
             inplace = True)
indo['Date'] = indo[['Month','Year']].apply(lambda x: ' '.join(x), axis=1)
indo.drop(['Unnamed: 1','Month','Year'],axis = 1, inplace = True)
indo['CPI_ID'] = indo['Unnamed: 2']
indo.drop(['Unnamed: 2'], axis = 1, inplace = True)
indo['Date'] = pd.to_datetime(indo['Date'])

Oil (CL=F) Price

In [5]:
oil = pd.read_excel('oilPrice.xls')
oil.replace(['2001-12-31'])
oil.head(3)

        Date      Close  Volume
0 2001-12-31  19.840000   36403
1 2002-01-02  21.010000   69560
2 2002-01-03  20.370001   64010

In [6]:
oil.iloc[0:3]

        Date      Close  Volume
0 2001-12-31  19.840000   36403
1 2002-01-02  21.010000   69560
2 2002-01-03  20.370001   64010

<center> M2 USD

In [7]:
M = pd.read_excel('M2USD.xls', skiprows = [1,2,3,4,5,6,7,8,9,10])
M.rename(columns = {'FRED Graph Observations':'Date','Unnamed: 1':'USD_M_Two' }, inplace = True)
M.head(5)

        Date  USD_M_Two
0 2002-01-07     5499.4
1 2002-01-14     5476.7
2 2002-01-21     5444.0
3 2002-01-28     5401.1
4 2002-02-04     5454.0

<center> M2 Indonesian Rupiah

In [8]:
MRp = pd.read_excel('M2 Rupiah.xlsx',skiprows=[1,2,3,4,5])
MRp = MRp.transpose()
MRp.columns = MRp.iloc[0]
MRp.drop([MRp.index[0]], axis = 0, inplace = True)
MRp.reset_index(inplace = True)
MRp.rename(columns = {'index':'Date','Jumlah (M2)':'IDR_M_Two'}, inplace = True)

In [9]:
auxilary = ['December 2003', 'December 2004', 'December 2005', 'December 2006','December 2007','December 2008','December 2009']
for i in range(0,7,1):
    MRp['Date'][i] = auxilary[i]

In [10]:
MRp['Date'] = pd.to_datetime(MRp['Date'])

In [11]:
MRp.iloc[-1]

Perihal
Date         2020-05-01 00:00:00
IDR_M_Two              6468193.5
Name: 131, dtype: object

In [12]:
MRpN = pd.read_excel('m2Rupiah1.xls', sheet_name = 'expel')
MRpN = MRpN.transpose()
MRpN.reset_index(inplace = True)
MRpN.rename(columns = {'index':'Date', 0:'IDR_M_Two'}, inplace = True)

In [13]:
New = pd.concat([MRp, MRpN])

In [14]:
MRP = New

<center> FED Federal Fund Rate

In [15]:
fed = pd.read_excel('FEDFUNDS.xls', skiprows = range(1,11,1))
fed.rename(columns = {'FRED Graph Observations': 'Date', 'Unnamed: 1': 'US_Rate'}, inplace = True)
fed.shape

(241, 2)

<center> Bank Indoneisa Rate

In [24]:
BI1 = pd.read_excel('BI-7Day-RR.xlsx', skiprows = [1,2,3,4], usecols = [1,2])
BI1.rename(columns = {'Unnamed: 1':'Date','Unnamed: 2':'ID_Rate'}, inplace = True)
BI1 = BI1.iloc[::-1]
BI1['ID_Rate'] = BI1['ID_Rate'].str.rstrip('%').astype('float')
BI1[['Date','Month','Year']] = BI1['Date'].loc[BI1['Date'].str.split().str.len() == 3].str.split(expand=True)
BI1.replace(['Januari','Februari','Maret',
              'April','Mei','Juni',
              'Juli','Agustus','Oktober',
              'Desember'],['January','February',
                           'March','April','May','June','July',
                           'August','October','December'],
             inplace = True)
BI1['Date'] = BI1[['Date','Month','Year']].apply(lambda x: ' '.join(x), axis = 1)
BI1.drop(['Month','Year'], axis = 1, inplace = True)
BI1.reset_index(inplace = True)
BI1.drop(['index'], axis = 1, inplace = True)
BI1['Date'] = pd.to_datetime(BI1['Date'])

BI1.head(5)

        Date  ID_Rate
0 2016-04-21     5.50
1 2016-05-19     5.50
2 2016-06-16     5.25
3 2016-07-21     5.25
4 2016-08-19     5.25

#### MERGE DATA

In [28]:
ab = pd.merge(oil,ch, how = 'outer', on = 'Date' )
bc = pd.merge(ab,us,how = 'outer', on = 'Date')
cd = pd.merge(bc,indo, how = 'outer', on = 'Date')
de = pd.merge(cd, M, how = 'outer', on = 'Date')
ef = pd.merge(de, MRP, how = 'outer', on = 'Date')
fg = pd.merge(ef, fed, how = 'outer', on = 'Date')
gh = pd.merge(fg, BI1, how = 'outer', on = 'Date')

In [29]:
GH = gh.sort_values(by = ['Date'])
GH.reset_index(inplace = True)
GH.drop(['index','Volume'],axis = 1, inplace = True)
GH.rename(columns = {'Close': 'OilPrice'}, inplace = True)

In [30]:
GH.head(5)

,Date,OilPrice,CPI_CH,CPI_US,CPI_ID,USD_M_Two,IDR_M_Two,US_Rate,ID_Rate
0,2001-12-31,19.840000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2002-01-01,NaN,71.061305,1.142204,NaN,NaN,NaN,1.73,NaN
2,2002-01-02,21.010000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2002-01-03,20.370001,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2002-01-04,21.620001,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [19]:
#EF.to_csv('test.csv', index = False)

DATE

In [20]:
df = pd.date_range(start = '2001-12-31', end = '2022-01-31')
DF = pd.DataFrame(df)
date = DF.rename(columns = {0:'Date'})

In [21]:
date.head(5)

        Date
0 2001-12-31
1 2002-01-01
2 2002-01-02
3 2002-01-03
4 2002-01-04

### <center> Transform XLSX to CSV

In [22]:
#ch.to_csv('/Users/satrio.m/Desktop/Nummr/cleanData/CPIChina.csv', index = False)
#us.to_csv('/Users/satrio.m/Desktop/Nummr/cleanData/CPIUS.csv', index = False)
#indo.to_csv('/Users/satrio.m/Desktop/Nummr/cleanData/CPIIndo.csv', index = False)
#oil.to_csv('/Users/satrio.m/Desktop/Nummr/cleanData/oilPrice.csv', index = False)
#date.to_csv('/Users/satrio.m/Desktop/Nummr/cleanData/date.csv', index = False)